dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxEvadc_reg.h
/** \brief 168C, Group 4 Result Control Register 3 */
#define EVADC_G4_RCR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF002168Cu)
/** Alias (User Manual Name) for EVADC_G4_RCR3.
* To use register names with standard convension, please use EVADC_G4_RCR3.
*/
#define EVADC_G4RCR3 (EVADC_G4_RCR3)

/** \brief 1690, Group 4 Result Control Register 4 */
#define EVADC_G4_RCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021690u)
/** Alias (User Manual Name) for EVADC_G4_RCR4.
* To use register names with standard convension, please use EVADC_G4_RCR4.
*/
#define EVADC_G4RCR4 (EVADC_G4_RCR4)

/** \brief 1694, Group 4 Result Control Register 5 */
#define EVADC_G4_RCR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021694u)
/** Alias (User Manual Name) for EVADC_G4_RCR5.
* To use register names with standard convension, please use EVADC_G4_RCR5.
*/
#define EVADC_G4RCR5 (EVADC_G4_RCR5)

/** \brief 1698, Group 4 Result Control Register 6 */
#define EVADC_G4_RCR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021698u)
/** Alias (User Manual Name) for EVADC_G4_RCR6.
* To use register names with standard convension, please use EVADC_G4_RCR6.
*/
#define EVADC_G4RCR6 (EVADC_G4_RCR6)

/** \brief 169C, Group 4 Result Control Register 7 */
#define EVADC_G4_RCR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF002169Cu)
/** Alias (User Manual Name) for EVADC_G4_RCR7.
* To use register names with standard convension, please use EVADC_G4_RCR7.
*/
#define EVADC_G4RCR7 (EVADC_G4_RCR7)

/** \brief 16A0, Group 4 Result Control Register 8 */
#define EVADC_G4_RCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216A0u)
/** Alias (User Manual Name) for EVADC_G4_RCR8.
* To use register names with standard convension, please use EVADC_G4_RCR8.
*/
#define EVADC_G4RCR8 (EVADC_G4_RCR8)

/** \brief 16A4, Group 4 Result Control Register 9 */
#define EVADC_G4_RCR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216A4u)
/** Alias (User Manual Name) for EVADC_G4_RCR9.
* To use register names with standard convension, please use EVADC_G4_RCR9.
*/
#define EVADC_G4RCR9 (EVADC_G4_RCR9)

/** \brief 16A8, Group 4 Result Control Register 10 */
#define EVADC_G4_RCR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216A8u)
/** Alias (User Manual Name) for EVADC_G4_RCR10.
* To use register names with standard convension, please use EVADC_G4_RCR10.
*/
#define EVADC_G4RCR10 (EVADC_G4_RCR10)

/** \brief 16AC, Group 4 Result Control Register 11 */
#define EVADC_G4_RCR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216ACu)
/** Alias (User Manual Name) for EVADC_G4_RCR11.
* To use register names with standard convension, please use EVADC_G4_RCR11.
*/
#define EVADC_G4RCR11 (EVADC_G4_RCR11)

/** \brief 16B0, Group 4 Result Control Register 12 */
#define EVADC_G4_RCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216B0u)
/** Alias (User Manual Name) for EVADC_G4_RCR12.
* To use register names with standard convension, please use EVADC_G4_RCR12.
*/
#define EVADC_G4RCR12 (EVADC_G4_RCR12)

/** \brief 16B4, Group 4 Result Control Register 13 */
#define EVADC_G4_RCR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216B4u)
/** Alias (User Manual Name) for EVADC_G4_RCR13.
* To use register names with standard convension, please use EVADC_G4_RCR13.
*/
#define EVADC_G4RCR13 (EVADC_G4_RCR13)

/** \brief 16B8, Group 4 Result Control Register 14 */
#define EVADC_G4_RCR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216B8u)
/** Alias (User Manual Name) for EVADC_G4_RCR14.
* To use register names with standard convension, please use EVADC_G4_RCR14.
*/
#define EVADC_G4RCR14 (EVADC_G4_RCR14)

/** \brief 16BC, Group 4 Result Control Register 15 */
#define EVADC_G4_RCR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00216BCu)
/** Alias (User Manual Name) for EVADC_G4_RCR15.
* To use register names with standard convension, please use EVADC_G4_RCR15.
*/
#define EVADC_G4RCR15 (EVADC_G4_RCR15)

/** \brief 1700, Group 4 Result Register 0\n */
#define EVADC_G4_RES0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021700u)
/** Alias (User Manual Name) for EVADC_G4_RES0.
* To use register names with standard convension, please use EVADC_G4_RES0.
*/
#define EVADC_G4RES0 (EVADC_G4_RES0)

/** \brief 1704, Group 4 Result Register 1\n */
#define EVADC_G4_RES1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021704u)
/** Alias (User Manual Name) for EVADC_G4_RES1.
* To use register names with standard convension, please use EVADC_G4_RES1.
*/
#define EVADC_G4RES1 (EVADC_G4_RES1)

/** \brief 1708, Group 4 Result Register 2\n */
#define EVADC_G4_RES2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021708u)
/** Alias (User Manual Name) for EVADC_G4_RES2.
* To use register names with standard convension, please use EVADC_G4_RES2.
*/
#define EVADC_G4RES2 (EVADC_G4_RES2)

/** \brief 170C, Group 4 Result Register 3\n */
#define EVADC_G4_RES3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002170Cu)
/** Alias (User Manual Name) for EVADC_G4_RES3.
* To use register names with standard convension, please use EVADC_G4_RES3.
*/
#define EVADC_G4RES3 (EVADC_G4_RES3)

/** \brief 1710, Group 4 Result Register 4\n */
#define EVADC_G4_RES4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021710u)
/** Alias (User Manual Name) for EVADC_G4_RES4.
* To use register names with standard convension, please use EVADC_G4_RES4.
*/
#define EVADC_G4RES4 (EVADC_G4_RES4)

/** \brief 1714, Group 4 Result Register 5\n */
#define EVADC_G4_RES5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021714u)
/** Alias (User Manual Name) for EVADC_G4_RES5.
* To use register names with standard convension, please use EVADC_G4_RES5.
*/
#define EVADC_G4RES5 (EVADC_G4_RES5)

/** \brief 1718, Group 4 Result Register 6\n */
#define EVADC_G4_RES6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021718u)
/** Alias (User Manual Name) for EVADC_G4_RES6.
* To use register names with standard convension, please use EVADC_G4_RES6.
*/
#define EVADC_G4RES6 (EVADC_G4_RES6)

/** \brief 171C, Group 4 Result Register 7\n */
#define EVADC_G4_RES7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002171Cu)
/** Alias (User Manual Name) for EVADC_G4_RES7.
* To use register names with standard convension, please use EVADC_G4_RES7.
*/
#define EVADC_G4RES7 (EVADC_G4_RES7)

