dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxEvadc_reg.h
/** \brief 17B0, Group 4 Result Reg. 12, Debug */
#define EVADC_G4_RESD12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217B0u)
/** Alias (User Manual Name) for EVADC_G4_RESD12.
* To use register names with standard convension, please use EVADC_G4_RESD12.
*/
#define EVADC_G4RESD12 (EVADC_G4_RESD12)

/** \brief 17B4, Group 4 Result Reg. 13, Debug */
#define EVADC_G4_RESD13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217B4u)
/** Alias (User Manual Name) for EVADC_G4_RESD13.
* To use register names with standard convension, please use EVADC_G4_RESD13.
*/
#define EVADC_G4RESD13 (EVADC_G4_RESD13)

/** \brief 17B8, Group 4 Result Reg. 14, Debug */
#define EVADC_G4_RESD14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217B8u)
/** Alias (User Manual Name) for EVADC_G4_RESD14.
* To use register names with standard convension, please use EVADC_G4_RESD14.
*/
#define EVADC_G4RESD14 (EVADC_G4_RESD14)

/** \brief 17BC, Group 4 Result Reg. 15, Debug */
#define EVADC_G4_RESD15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217BCu)
/** Alias (User Manual Name) for EVADC_G4_RESD15.
* To use register names with standard convension, please use EVADC_G4_RESD15.
*/
#define EVADC_G4RESD15 (EVADC_G4_RESD15)

/** \brief 1810, Trigger Control Register, Group 5 */
#define EVADC_G5_TRCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_TRCTR*)0xF0021810u)
/** Alias (User Manual Name) for EVADC_G5_TRCTR.
* To use register names with standard convension, please use EVADC_G5_TRCTR.
*/
#define EVADC_G5TRCTR (EVADC_G5_TRCTR)

/** \brief 1880, Arbitration Config. Register, Group 5 */
#define EVADC_G5_ARBCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ARBCFG*)0xF0021880u)
/** Alias (User Manual Name) for EVADC_G5_ARBCFG.
* To use register names with standard convension, please use EVADC_G5_ARBCFG.
*/
#define EVADC_G5ARBCFG (EVADC_G5_ARBCFG)

/** \brief 1884, Arbitration Priority Register, Group 5 */
#define EVADC_G5_ARBPR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ARBPR*)0xF0021884u)
/** Alias (User Manual Name) for EVADC_G5_ARBPR.
* To use register names with standard convension, please use EVADC_G5_ARBPR.
*/
#define EVADC_G5ARBPR (EVADC_G5_ARBPR)

/** \brief 1888, Analog Fct. Config. Register, Group 5 */
#define EVADC_G5_ANCFG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ANCFG*)0xF0021888u)
/** Alias (User Manual Name) for EVADC_G5_ANCFG.
* To use register names with standard convension, please use EVADC_G5_ANCFG.
*/
#define EVADC_G5ANCFG (EVADC_G5_ANCFG)

/** \brief 18A0, Input Class Register 0, Group 5 */
#define EVADC_G5_ICLASS0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00218A0u)
/** Alias (User Manual Name) for EVADC_G5_ICLASS0.
* To use register names with standard convension, please use EVADC_G5_ICLASS0.
*/
#define EVADC_G5ICLASS0 (EVADC_G5_ICLASS0)

/** \brief 18A4, Input Class Register 1, Group 5 */
#define EVADC_G5_ICLASS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ICLASS*)0xF00218A4u)
/** Alias (User Manual Name) for EVADC_G5_ICLASS1.
* To use register names with standard convension, please use EVADC_G5_ICLASS1.
*/
#define EVADC_G5ICLASS1 (EVADC_G5_ICLASS1)

/** \brief 18B0, Alias Register, Group 5 */
#define EVADC_G5_ALIAS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_ALIAS*)0xF00218B0u)
/** Alias (User Manual Name) for EVADC_G5_ALIAS.
* To use register names with standard convension, please use EVADC_G5_ALIAS.
*/
#define EVADC_G5ALIAS (EVADC_G5_ALIAS)

/** \brief 18B8, Boundary Select Register, Group 5 */
#define EVADC_G5_BOUND /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_BOUND*)0xF00218B8u)
/** Alias (User Manual Name) for EVADC_G5_BOUND.
* To use register names with standard convension, please use EVADC_G5_BOUND.
*/
#define EVADC_G5BOUND (EVADC_G5_BOUND)

/** \brief 18C0, Synchronization Control Register, Group 5 */
#define EVADC_G5_SYNCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SYNCTR*)0xF00218C0u)
/** Alias (User Manual Name) for EVADC_G5_SYNCTR.
* To use register names with standard convension, please use EVADC_G5_SYNCTR.
*/
#define EVADC_G5SYNCTR (EVADC_G5_SYNCTR)

/** \brief 1900, Queue 0 Source Contr. Register, Group 5 */
#define EVADC_G5_Q0_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021900u)
/** Alias (User Manual Name) for EVADC_G5_Q0_QCTRL.
* To use register names with standard convension, please use EVADC_G5_Q0_QCTRL.
*/
#define EVADC_G5QCTRL0 (EVADC_G5_Q0_QCTRL)

/** \brief 1904, Queue 0 Mode Register, Group 5 */
#define EVADC_G5_Q0_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021904u)
/** Alias (User Manual Name) for EVADC_G5_Q0_QMR.
* To use register names with standard convension, please use EVADC_G5_Q0_QMR.
*/
#define EVADC_G5QMR0 (EVADC_G5_Q0_QMR)

/** \brief 1908, Queue 0 Status Register, Group 5 */
#define EVADC_G5_Q0_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021908u)
/** Alias (User Manual Name) for EVADC_G5_Q0_QSR.
* To use register names with standard convension, please use EVADC_G5_Q0_QSR.
*/
#define EVADC_G5QSR0 (EVADC_G5_Q0_QSR)

/** \brief 190C, Queue 0 Register 0, Group 5 */
#define EVADC_G5_Q0_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002190Cu)
/** Alias (User Manual Name) for EVADC_G5_Q0_Q0R.
* To use register names with standard convension, please use EVADC_G5_Q0_Q0R.
*/
#define EVADC_G5Q0R0 (EVADC_G5_Q0_Q0R)

/** \brief 1910, Queue 0 Input Register, Group 5 */
#define EVADC_G5_Q0_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021910u)
/** Alias (User Manual Name) for EVADC_G5_Q0_QINR.
* To use register names with standard convension, please use EVADC_G5_Q0_QINR.
*/
#define EVADC_G5QINR0 (EVADC_G5_Q0_QINR)

/** \brief 1914, Queue 0 Backup Register, Group 5 */
#define EVADC_G5_Q0_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021914u)
/** Alias (User Manual Name) for EVADC_G5_Q0_QBUR.
* To use register names with standard convension, please use EVADC_G5_Q0_QBUR.
*/
#define EVADC_G5QBUR0 (EVADC_G5_Q0_QBUR)

/** \brief 1918, Queue 0 Requ. Timer Mode Reg., Group 5 */
#define EVADC_G5_Q0_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021918u)
/** Alias (User Manual Name) for EVADC_G5_Q0_REQTM.
* To use register names with standard convension, please use EVADC_G5_Q0_REQTM.
*/
#define EVADC_G5REQTM0 (EVADC_G5_Q0_REQTM)

/** \brief 191C, Queue 0 Requ. Timer Status Reg., Group 5 */
#define EVADC_G5_Q0_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002191Cu)
/** Alias (User Manual Name) for EVADC_G5_Q0_REQTS.
* To use register names with standard convension, please use EVADC_G5_Q0_REQTS.
*/
#define EVADC_G5REQTS0 (EVADC_G5_Q0_REQTS)

/** \brief 1920, Queue 1 Source Contr. Register, Group 5 */
#define EVADC_G5_Q1_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021920u)
/** Alias (User Manual Name) for EVADC_G5_Q1_QCTRL.
* To use register names with standard convension, please use EVADC_G5_Q1_QCTRL.
*/
#define EVADC_G5QCTRL1 (EVADC_G5_Q1_QCTRL)

/** \brief 1924, Queue 1 Mode Register, Group 5 */
#define EVADC_G5_Q1_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021924u)
/** Alias (User Manual Name) for EVADC_G5_Q1_QMR.
* To use register names with standard convension, please use EVADC_G5_Q1_QMR.
*/
#define EVADC_G5QMR1 (EVADC_G5_Q1_QMR)

/** \brief 1928, Queue 1 Status Register, Group 5 */
#define EVADC_G5_Q1_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021928u)
/** Alias (User Manual Name) for EVADC_G5_Q1_QSR.
* To use register names with standard convension, please use EVADC_G5_Q1_QSR.
*/
#define EVADC_G5QSR1 (EVADC_G5_Q1_QSR)

